drxnch/device-stm32/Firmware/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"
#include "stm32l4xx_hal_tim.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ssd1306.h"
#include "ssd1306_tests.h"
#include "ssd1306_fonts.h"
#include "display.h"

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct {
  char *name;
  uint8_t next_screen;  
} menu_screen;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* Top Level / Home States */

#define MAIN_MENU 0
#define MUSIC_MENU 1
#define TIMER_MENU 2
#define ALARM_MENU 3
#define SETTINGS_MENU 4

// #define HOME_PAGE_STATE           0
// #define HOME_MUSIC_STATE     1
// #define HOME_TIMER_STATE     2
// #define HOME_ALARM_STATE     3

// /* Music Sub-States */
// #define MUSIC_HOME_STATE 4
// #define MUSIC_PLAYLIST_STATE 5
// #define MUSIC_ALBUM_STATE    6
// #define MUSIC_ALLSONGS_STATE 7
// #define MUSIC_ARTIST_STATE 14

// /* Timer Sub-States */
#define PRESET_TIMERS_MENU   9
#define SET_TIMER_MENU

// /* Alarm Sub-States */
// #define ALARM_HOME_STATE 11
// #define ALARM_PRESET_STATE   12
// #define ALARM_SET_STATE      13

//Debugging defines
#define LD3_ON  (HAL_GPIO_WritePin(LD3_GPIO_Port,LD3_Pin, GPIO_PIN_SET))
#define LD3_OFF  (HAL_GPIO_WritePin(LD3_GPIO_Port,LD3_Pin, GPIO_PIN_RESET))
#define LD2_ON  (HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin, GPIO_PIN_SET))
#define LD2_OFF  (HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin, GPIO_PIN_RESET))



#define PLAY_PRESSED (HAL_GPIO_ReadPin(BUTTON_PLAY_GPIO_Port, BUTTON_PLAY_Pin) == GPIO_PIN_SET)
#define REWIND_PRESSED (HAL_GPIO_ReadPin(BUTTON_REWIND_GPIO_Port, BUTTON_REWIND_Pin) == GPIO_PIN_SET)
#define SKIP_PRESSED (HAL_GPIO_ReadPin(BUTTON_SKIP_GPIO_Port, BUTTON_SKIP_Pin) == GPIO_PIN_SET)
#define VOL_DOWN_PRESSED (HAL_GPIO_ReadPin(BUTTON_VOL_DOWN_GPIO_Port, BUTTON_VOL_DOWN_Pin) == GPIO_PIN_SET)
#define VOL_UP_PRESSED   (HAL_GPIO_ReadPin(BUTTON_VOL_UP_GPIO_Port, BUTTON_VOL_UP_Pin) == GPIO_PIN_SET)
#define SCROLL_BUTTON_PRESSED (HAL_GPIO_ReadPin(BUTTON_SCROLL_GPIO_Port, BUTTON_SCROLL_Pin) == GPIO_PIN_RESET)

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef hlpuart1;

SAI_HandleTypeDef hsai_BlockA1;
DMA_HandleTypeDef hdma_sai1_a;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1_rx;
DMA_HandleTypeDef hdma_sdmmc1_tx;

TIM_HandleTypeDef htim1;

/* USER CODE BEGIN PV */
/*
  _____  _____  _______      __       _______ ______   __      __     _____  _____          ____  _      ______  _____ 
 |  __ \|  __ \|_   _\ \    / /   /\ |__   __|  ____|  \ \    / /\   |  __ \|_   _|   /\   |  _ \| |    |  ____|/ ____|
 | |__) | |__) | | |  \ \  / /   /  \   | |  | |__      \ \  / /  \  | |__) | | |    /  \  | |_) | |    | |__  | (___   
 |  ___/|  _  /  | |   \ \/ /   / /\ \  | |  |  __|      \ \/ / /\ \ |  _  /  | |   / /\ \ |  _ <| |    |  __|  \___ \  
 | |    | | \ \ _| |_   \  /   / ____ \ | |  | |____      \  / ____ \| | \ \ _| |_ / ____ \| |_) | |____| |____ ____) | 
 |_|    |_|  \_\_____|   \/   /_/    \_\|_|  |______|      \/_/    \_\_|  \_\_____/_/    \_\____/|______|______|_____/ 
                                                     
                                                                  
*/

//Initialisation Code
char test_song[20]="music.wav";
uint8_t current_state = 0;
uint8_t next_state = 0;
bool down_button_last = false;


// SDMMC
FATFS MyFatFS; 
FIL MyFile;    
FRESULT res; 
UINT bw;  
uint32_t byteswritten;

// Audio
#define AUDIO_BUF_SIZE 4096 
#define READBUF_SIZE 4096
uint16_t audio_buffer[AUDIO_BUF_SIZE]; // The main buffer
uint8_t playing = 0;                   // State flag
UINT bytes_read;                       // To track SD card progress
uint8_t readBuf[READBUF_SIZE]; // Buffer for encoded MP3 data
int16_t outBuf[2 * 1152];      // Buffer for decoded PCM data
uint32_t adc_buffer[1];
uint8_t timer_ready = 0;
uint8_t last_button_state = 0; 

// Display
uint8_t music_option = 0;
uint16_t gpio_pin = 0;
uint32_t duration;
uint8_t button_scroll_flag = 0;


// Miscellaneous (Buttons, Sensors, States etc.)
// All Inputs
uint8_t input_flags = 0x0; // Scroll Button | Scroll 2 (S2) | Scroll 1 (S1) | Vol Down | Vol Up | Rewind | Play | Skip
#define SCROLL_KEY_BIT 7
#define S2_BIT 6
#define S1_BIT 5
#define VOL_DOWN_BIT 4
#define VOL_UP 3
#define REWIND_KEY_BIT 2
#define PLAY_KEY_BIT 1
#define SKIP_KEY_BIT 0


uint8_t previous_volume = 0;
volatile int8_t scroll_value = 0;
int8_t previous_scroll_value = 0;
uint8_t refresh_needed = 0;
uint8_t scroll_button_hold = 0;

uint8_t option = 0;
uint8_t music_volume = 0;
GPIO_PinState s1, s2 = GPIO_PIN_RESET;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_I2C1_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SAI1_Init(void);
static void MX_ADC1_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/*
  _____  _____  _______      __       _______ ______   _    _  _____ ______ _____     _____  ____  _____  ______  
 |  __ \|  __ \|_   _\ \    / /   /\ |__   __|  ____| | |  | |/ ____|  ____|  __ \   / ____|/ __ \|  __ \|  ____| 
 | |__) | |__) | | |  \ \  / /   /  \   | |  | |__    | |  | | (___ | |__  | |__) | | |    | |  | | |  | | |__   
 |  ___/|  _  /  | |   \ \/ /   / /\ \  | |  |  __|   | |  | |\___ \|  __| |  _  /  | |    | |  | | |  | |  __|  
 | |    | | \ \ _| |_   \  /   / ____ \ | |  | |____  | |__| |____) | |____| | \ \  | |____| |__| | |__| | |____ 
 |_|    |_|  \_\_____|   \/   /_/    \_\|_|  |______|  \____/|_____/|______|_|  \_\  \_____|\____/|_____/|______|
                                                                                   
                              
*/

// void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
//   timer_ready = 1;
// 	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_7);

// }

void TestInputsOnly() {
  if (PLAY_PRESSED || REWIND_PRESSED || SKIP_PRESSED || VOL_DOWN_PRESSED || VOL_UP_PRESSED || SCROLL_BUTTON_PRESSED) HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_SET);
  else HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_RESET);
}

void TestInputsAndDisplay() {
  ssd1306_Fill(Black);
  #ifdef SSD1306_INCLUDE_FONT_7x10
  ssd1306_SetCursor(2, 25);

  if (PLAY_PRESSED) DrawTextToScreen("Play");
  else if (REWIND_PRESSED) ssd1306_WriteString("Rewind", Font_7x10, White);
  else if (SKIP_PRESSED) ssd1306_WriteString("Skip", Font_7x10, White);
  else if (VOL_DOWN_PRESSED) ssd1306_WriteString("Volume Down", Font_7x10, White);
  else if (VOL_UP_PRESSED) ssd1306_WriteString("Volume Up", Font_7x10, White);
  else if (SCROLL_BUTTON_PRESSED) ssd1306_WriteString("Scroll Pressed", Font_7x10, White);
  
  #endif
  ssd1306_UpdateScreen();
}

void TestSD() {
  UINT bw; // Variable to store how many bytes were actually written
  res = f_mount(&MyFatFS, (TCHAR const *)SDPath, 1); // res = result

  if (res == FR_OK) {
    res = f_mkdir("notes");
    DrawTextToScreen("mkdir notes");
    if (res == FR_OK || res == FR_EXIST) {
      res = f_open(&MyFile, "notes/poo.txt", FA_WRITE | FA_CREATE_ALWAYS);
      if (res == FR_OK) {
        f_write(&MyFile, "Gurt: Yo!", 9, &bw);
        DrawTextToScreen("Gurt:Yo!");
        f_close(&MyFile);
        }
      else {
        DrawTextToScreen("Open Failure");
      }
    }
    f_mount(NULL, "", 0);
  }
  else {
    char err[20];
    sprintf(err, "Res Error: %d", res);
    DrawTextToScreen(err);
  }
}

void PlaySong(char song[20]) {
    res = f_mount(&MyFatFS, (TCHAR const *)SDPath, 1);
  if (res == FR_OK) {
    // 2. Open the audio file
    res = f_open(&MyFile, "music.wav", FA_READ);
    if (res == FR_OK) {
      // 3. Skip WAV header (44 bytes)
      f_lseek(&MyFile, 44);
      // 4. Initial Buffer Fill (Read bytes, but fill half the samples)
      // We read AUDIO_BUF_SIZE * 2 because each sample is 2 bytes (uint16_t)
      res = f_read(&MyFile, audio_buffer, AUDIO_BUF_SIZE * 2, &bytes_read);
      if (res == FR_OK && bytes_read > 0) {
        // 5. Start SAI DMA (SAI expects number of samples, not bytes)
        HAL_SAI_Transmit_DMA(&hsai_BlockA1, (uint8_t *)audio_buffer,
                             AUDIO_BUF_SIZE);
        playing = 1;
      }
    } else {
      // Show error if file not found
      char errBuf[20];
      sprintf(errBuf, "Open Error: %d", res);
      ssd1306_SetCursor(2, 30);
      ssd1306_WriteString(errBuf, Font_7x10, White);
      ssd1306_UpdateScreen();
    }
  }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

