drxnch/device-stm32/Firmware/Core/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_LPUART1_UART_Init();
  MX_USB_HOST_Init();
  MX_TIM1_Init();
  MX_I2C1_Init();
  MX_SDMMC1_SD_Init();
  MX_FATFS_Init();
  MX_SAI1_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */

/*
  _____ _   _ _____ _______ _____          _      _____  _____         _______  _____  ____  _   _  _____ 
 |_   _| \ | |_   _|__   __|_   _|   /\   | |    |_   _|/ ____|  / \  |__    __|_   _|/ __ \| \ | |/ ____|
   | | |  \| | | |    | |    | |    /  \  | |      | | | (___   /   \    |  |    | | | |  | |  \| | (___  
   | | | . ` | | |    | |    | |   / /\ \ | |      | |  \___ \ /  /\ \   |  |    | | | |  | | . ` |\___ \ 
  _| |_| |\  |_| |_   | |   _| |_ / ____ \| |____ _| |_ ____) /  ____ \  |  |   _| |_| |__| | |\  |____) |
 |_____|_| \_|_____|  |_|  |_____/_/    \_\______|_____|_____/_/     \ \_|__|  |_____|\____/|_| \_|_____/ 
                                                                                                       
*/
  
// Initialisations
  HAL_TIM_Base_Start_IT(&htim1);

  // Display Initialisation
  ssd1306_Init();
     TestSD();

  menu_screen main_menu[] = {
    {"Music", MUSIC_MENU},
    {"Timer", TIMER_MENU},
    {"Alarm", ALARM_MENU},
    {"Settings", SETTINGS_MENU}
  };

  menu_screen timer_menu[] = {
    {"Back", MAIN_MENU},
    {"Preset Timers", PRESET_TIMERS_MENU},
    {"Set Timer", SET_TIMER_MENU}
  };

  //PlaySong(test_song);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  /*
 __          _   _    _ _____ _      ______   _      ____   ____  _____  
 \ \        / / | |  | |_   _| |    |  ____| | |    / __ \ / __ \|  __ \ 
  \ \  /\  / /  | |__| | | | | |    | |__    | |   | |  | | |  | | |__) |
   \ \/  \/ /   |  __  | | | | |    |  __|   | |   | |  | | |  | |  ___/ 
    \  /\  /    | |  | |_| |_| |____| |____  | |___| |__| | |__| | |     
     \/  \/     |_|  |_|_____|______|______| |______\____/ \____/|_|     
                                                                       
*/
  while (1) {

    /* Debugging Functions */
    //TestInputs();
    //TestInputsAndDisplay();

    /*Controller - View Inputs and change variables accordingly*/
    //Checking scroll
    static uint8_t last_s1_state = 0;
    uint8_t current_s1 = (input_flags >> S1_BIT) & 1;
    if (current_s1 && !last_s1_state) {
      if ((input_flags >> S2_BIT) & 1) {
        option ++;
      }
      else {
        option --;
      }
      scroll_value = 0;
      refresh_needed=1;
      input_flags &= ~((1<<S1_BIT) | (1<<S2_BIT));
    }

    //Volume
    if (music_volume > 20) music_volume = 20;
    else if (music_volume < 0) music_volume = 0;

    if (option > 4) option = 1;
    else if (option < 1) option = 4;

    switch (current_state) {
      case MAIN_MENU:
        if (button_scroll_flag) { 
          button_scroll_flag = 0;
          current_state = main_menu[option-1].next_screen; 
          refresh_needed=1; 
          option=1;
        }
        break;
      case TIMER_MENU:
        if (button_scroll_flag) { 
          button_scroll_flag =0;
          current_state = timer_menu[option-1].next_screen;
          refresh_needed=1;
          option=1;
        }
        break;
      // case MUSIC_MENU:
      //   if (button_scroll_flag){PageNotMade("Music Menu"); button_scroll_flag = 0;}
      //   break;
      // case ALARM_MENU:
      //   if (button_scroll_flag){PageNotMade("Alarm Menu"); button_scroll_flag = 0;}
      //   break;
      // case SETTINGS_MENU:
      //   if (button_scroll_flag){PageNotMade("Settings Menu"); button_scroll_flag = 0;}
      //   break;
      default:
        break;
    }
    /* Draw to Screen */
    if (refresh_needed) {
      switch (current_state) {
        case MAIN_MENU: DisplayOptions(option,main_menu[0].name, main_menu[1].name, main_menu[2].name, main_menu[3].name); break;
        case TIMER_MENU: DisplayOptionsTwo(option, timer_menu[0].name, timer_menu[1].name); break;
        default: break;
      }
      
    }
    refresh_needed=0;
    /* USER CODE END WHILE */
    MX_USB_HOST_Process();

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_9;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 5;
  RCC_OscInitStruct.PLL.PLLN = 71;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV6;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV4;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }

  /** Enable MSI Auto calibration
  */
  HAL_RCCEx_EnableMSIPLLMode();
}

/**
  * @brief Peripherals Common Clock Configuration
  * @retval None
  */
void PeriphCommonClock_Config(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the peripherals clock
  */
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SAI1|RCC_PERIPHCLK_USB
                              |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_ADC;
  PeriphClkInit.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLLSAI1;
  PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_PLLSAI1;
  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLLSAI1;
  PeriphClkInit.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_PLLSAI1;
  PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_MSI;
  PeriphClkInit.PLLSAI1.PLLSAI1M = 5;
  PeriphClkInit.PLLSAI1.PLLSAI1N = 20;
  PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_SAI1CLK|RCC_PLLSAI1_48M2CLK
                              |RCC_PLLSAI1_ADC1CLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

